---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrderError
source: html/2ea2531d-dfd0-a899-9aa8-6426e3c7f928.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrderError Property

Curtain wall grid lines have changed order.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridOutOfOrderError { get; }
```